export const data:
  {
    title: string;
    summary: string;
    detail: string;
    teacher: string;
    period: string;
    area: string;
  }[] = [
    {
      title: "現代教育学入門",
      summary: "教育学の多様な深化と広がりを学際的に学び、体験することを目指す。",
      detail: "教育は真空のなかで行われる無機質な営為ではない。それは歴史的・文化的・社会的空間で営まれると同時に，極めて複雑で歴史的な存在としての「人間」の生のなかに深く織り込まれ，かつ，「人間」そのものを歴史的・文化的・社会的存在として形成していく当のものである。この意味で教育学とは，様々に生起する教育という事象を巡りながら，「人間とは何か」という問いそのものを陰に陽に問い続ける学問だと言えるだろう。本講義では，こうした教育と教育学とを基礎的視点から描き出すことを目指していくこととする。本授業では、現代の教育、特に子どもと学校教育が抱えるテーマを選び、それらがどこから生じているのかという観点から紐解いていく。教育問題を解決する特効薬はない。その前提に立ち、それら課題を構造的に理解することをねらいとする。 ",
      teacher: "清水 良彦",
      period: "春学期 木曜日 １時限",
      area: "伊都地区"
    },
    {
      title: "ソフトウェア技術を利用したシステム構築のための技術論I",
      summary: "IoT時代に対応するため、ITインフラの基礎知識を習得する。",
      detail: "IoT時代を迎え、あらゆる「モノ」がネットワークに接続されることにより、ITインフラに対するユーザニーズも今後、大きく変化することが予想されています。本講義ではますます重要となる、ITインフラを支える「ネットワークの基礎」、「DNS/NTPの仕組み」、「コンピューティングの基礎」について講義の講義にて、ITインフラの基礎的な知識を習得する講義による座学の授業とネットワーク機器やサーバリソースなどを使用した演習",
      teacher: "岡村 耕二",
      period: "夏学期 水曜日 ４時限",
      area: "伊都地区"
    },
    {
      title: "教育基礎学入門",
      summary: "教育を通じ「人間とは何か」を問う視点から教育学を基礎的に学ぶ。",
      detail: "教育は真空のなかで行われる無機質な営為ではない。それは歴史的・文化的・社会的空間で営まれると同時に，極めて複雑で歴史的な存在としての「人間」の生のなかに深く織り込まれ，かつ，「人間」そのものを歴史的・文化的・社会的存在として形成していく当のものである。この意味で教育学とは，様々に生起する教育という事象を巡りながら，「人間とは何か」という問いそのものを陰に陽に問い続ける学問だと言えるだろう。本講義では，こうした教育と教育学とを基礎的視点から描き出すことを目指していくこととする。 ",
      teacher: "清水 良彦",
      period: "夏学期 木曜日 １時限",
      area: "伊都地区"
    },
    {
      title: "Webアプリケーション開発入門",
      summary: "Web開発に必要なプログラミングとインフラ構築の基礎を習得する。",
      detail: "本授業を通じて、AI技術をどのように活用するか、その可能性を理解し、今後のキャリアに繋がる指針を得ることができます。なお、専攻や学年を問わず、初心者でも受講可能です。 ",
      teacher: "岡村 耕二",
      period: "夏学期 水曜日 ４時限",
      area: "伊都地区"
    }
  ]